In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
##load dataset
file = "data"

train_info_path = file + "/info_train.csv"
train_work_path = file + "/work_train.csv"
train_label_path = file + "/label_train.csv"

test_info_path = file + "/info_test.csv"
test_work_path = file + "/work_test.csv"
test_label_path = file + "/label_test.csv"


## data frame
train_info = pd.read_csv(train_info_path)
train_work = pd.read_csv(train_work_path)
train_label = pd.read_csv(train_label_path)

test_info = pd.read_csv(test_info_path)
test_work = pd.read_csv(test_work_path)
test_label = pd.read_csv(test_label_path)

In [3]:
display(train_info.info())
print("/////////")
display(train_work.info())
print("/////////")
display(train_label.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27502 entries, 0 to 27501
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   bithYear  27502 non-null  int64
 1   gender    27502 non-null  object
 2   address   13214 non-null  object
 3   id_bh     27502 non-null  int64
dtypes: int64(2), object(2)
memory usage: 859.6+ KB

None

/////////
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 247559 entries, 0 to 247558
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             247559 non-null  int64
 1   id_bh          247559 non-null  int64
 2   id_management  247559 non-null  int64
 3   id_office      235391 non-null  object
 4   company_type   247559 non-null  int64
 5   job/role       214102 non-null  object
 6   from_date      247559 non-null  int64
 7   to_date        247559 non-null  int64
 8   employee_lv    247554 non-null  float64
 9   address        183528 non-null  object
dtypes: float64(1), int64(6), object(3)
memory usage: 18.9+ MB

None

/////////
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27502 entries, 0 to 27501
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id_bh   27502 non-null  int64
 1   label   27502 non-null  int64
dtypes: int64(2)
memory usage: 429.8 KB

None

In [4]:
display(test_info.info())
print("/////////")
display(test_work.info())
print("/////////")
display(test_label.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18134 entries, 0 to 18133
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   bithYear  18134 non-null  int64
 1   gender    18134 non-null  object
 2   address   8693 non-null   object
 3   id_bh     18134 non-null  int64
dtypes: int64(2), object(2)
memory usage: 566.8+ KB

None

/////////
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 162283 entries, 0 to 162282
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             162283 non-null  int64
 1   id_bh          162283 non-null  int64
 2   id_management  162283 non-null  int64
 3   id_office      154300 non-null  object
 4   company_type   162283 non-null  int64
 5   job/role       140198 non-null  object
 6   from_date      162283 non-null  int64
 7   to_date        162283 non-null  int64
 8   employee_lv    162280 non-null  float64
 9   address        120728 non-null  object
dtypes: float64(1), int64(6), object(3)
memory usage: 12.4+ MB

None

/////////
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18134 entries, 0 to 18133
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id_bh   18134 non-null  int64
dtypes: int64(1)
memory usage: 141.8 KB

None

In [5]:
## file label la: id tu file info
## train - 27502 - id
## test - 18134 -id

## - info: train, test co lap lai id nguoi

## 1. View data

### 1.1. info

In [6]:
## check id unique
print(train_info.groupby('id_bh').nunique().shape)
print(test_info.groupby('id_bh').nunique().shape)

(27502, 3)
(18134, 3)

In [7]:
info = pd.concat([train_info, test_info],axis=0)
print(info.groupby('id_bh').nunique().shape)
info.info()

(45636, 3)
<class 'pandas.core.frame.DataFrame'>
Int64Index: 45636 entries, 0 to 18133
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   bithYear  45636 non-null  int64
 1   gender    45636 non-null  object
 2   address   21907 non-null  object
 3   id_bh     45636 non-null  int64
dtypes: int64(2), object(2)
memory usage: 1.7+ MB

In [8]:
info.head(5)

   bithYear  gender           address      id_bh
0      1971    MALE            hà Nội  113039360
1      1993  FEMALE  Thành phố Hà Nội  116074930
2      1977    MALE               NaN  203060233
3      1996  FEMALE               NaN  131373210
4      1971    MALE               NaN  198079441

In [9]:
## check value in bithYear
print(info['bithYear'].describe())

count    45636.000000
mean      1984.331317
std          8.838014
min       1941.000000
25%       1978.000000
50%       1985.000000
75%       1991.000000
max       2018.000000
Name: bithYear, dtype: float64

In [10]:
## max bithyear 2018?? - co 3 ng la sinh tu 2002
info[info['bithYear'] > 2002]

       bithYear  gender address       id_bh
10551      2004  FEMALE     NaN   123374023
11256      2018    MALE     NaN  1921488221
13838      2003    MALE     NaN  2421340343

In [11]:
info['gender'].value_counts()

FEMALE    23764
MALE      21872
Name: gender, dtype: int64

In [12]:
## fix gender male - 0, female -1
gender_ ={1:"MALE", 0:"FEMALE"}
# info.gender.replace(gender_)
# info.head()

In [13]:
info['address'].value_counts().to_csv("add_info")

In [14]:
info['address'] = info.apply(lambda row: str(row.address).upper(), axis = 1)
info.head(20)

    bithYear  gender           address       id_bh
0       1971    MALE            HÀ NỘI   113039360
1       1993  FEMALE  THÀNH PHỐ HÀ NỘI   116074930
2       1977    MALE               NAN   203060233
3       1996  FEMALE               NAN   131373210
4       1971    MALE               NAN   198079441
5       1990  FEMALE               NAN   122297926
6       1985    MALE               NAN   131779898
7       1993    MALE               NAN   124687252
8       1988  FEMALE               NAN   124692420
9       1992  FEMALE               NAN   131397218
10      1991    MALE          NAM ĐỊNH   116023499
11      1994    MALE  THÀNH PHỐ HÀ NỘI  7916338450
12      1995    MALE               NAN   124723316
13      1973    MALE            HÀ NỘI   111221371
14      1982    MALE            HÀ NỘI  1110002009
15      1977  FEMALE               NAN  8507010180
16      1988  FEMALE               NAN   131547836
17      1976  FEMALE             TỔ 21   116034592
18      1986    MALE            HÀ NỘI   110161279
19      1983    MALE               NAN   131547834

In [15]:
## address: Nhieu ten bi trung: can quy ve chuan cua 63 tinh thanh

## 2. WORK

In [16]:
work = pd.concat([train_work, test_work], axis = 0)
work.head()

,id,id_bh,id_management,id_office,company_type,job/role,from_date,to_date,employee_lv,address
0,1,113039360,106,TF2212F,-1,Giám đốc,20130100,20151200,7.0,Hà Nội
1,1,113039360,106,TF2212F,-1,Giám đốc,20160100,20220400,10.0,Hà Nội
2,2,116074930,102,TB16010,-1,Nhân viên lễ tân,20160600,20161200,7.0,Hà Nội
3,2,116074930,102,TB16010,-1,Nhân viên lễ tân,20170100,20170300,8.0,Hà Nội
4,2,116074930,102,NaN,-1,NaN,20170400,20170700,-1.0,NaN

In [17]:
work.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 409842 entries, 0 to 162282
Data columns (total 10 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   id             409842 non-null  int64
 1   id_bh          409842 non-null  int64
 2   id_management  409842 non-null  int64
 3   id_office      389691 non-null  object
 4   company_type   409842 non-null  int64
 5   job/role       354300 non-null  object
 6   from_date      409842 non-null  int64
 7   to_date        409842 non-null  int64
 8   employee_lv    409834 non-null  float64
 9   address        304256 non-null  object
dtypes: float64(1), int64(6), object(3)
memory usage: 34.4+ MB

### 2.1. id_management - cate

In [18]:
work['id_management'].value_counts().head()

2600    92105
2400    48207
7500    19784
7900    15630
2700    14417
Name: id_management, dtype: int64

In [19]:
## nhieu gia tri qua: chac la cat bot :D, roi label encoder

### 2.2. id_office - category
17271 - toa khac nhau: tach 2 chu cai dau va chu cai cuoi

In [20]:
work['id_office'].value_counts()

YN0042Z    19345
HZ0000Z    13309
YN0023Z     9240
YN0021Z     6468
YN0114Z     5506
           ...
TI0494I        1
YV0119A        1
TG3753G        1
TG1782G        1
TC0885C        1
Name: id_office, Length: 17271, dtype: int64

### 2.3. company_type - category

In [21]:
work['company_type'].value_counts()

-1    282123
 1     45243
 6     36322
 7     29706
 3      4867
 8      4712
 2      3421
 4      3307
 5       141
Name: company_type, dtype: int64

## 2.4. job/role
- nhieu cong viec
- can xem xet su khac nhau cua cac title nhu: Công nhân vs Công nhân sản xuất

In [22]:
work['job/role'].value_counts()

Công nhân                                        19748
Giáo viên                                        17911
Nhân viên                                        15676
Công nhân vận hành máy may                       11726
Công nhân sản xuất                                9025
                                                 ...
Phó Trưởng phòng - Kiểm sát viên cao cấp             1
Phó Trưởng phòng Viện 3                              1
Kiểm sát viên cao cấp                                1
Kỹ sư xây dựng bậc 6/8 - Phó phòng kinh doanh        1
Đội phó đội Đô Lương                                 1
Name: job/role, Length: 42006, dtype: int64

## 2.5. employee_lv - category: ordinal

In [23]:
work['employee_lv'].value_counts()

8.0      51981
7.0      51543
9.0      45103
6.0      44652
5.0      34321
         ...
56.0        50
57.0        39
58.0        38
331.0        1
369.0        1
Name: employee_lv, Length: 63, dtype: int64

In [24]:
## check 331, 369: employee level
work[work['employee_lv'] > 50]

,id,id_bh,id_management,id_office,company_type,job/role,from_date,to_date,employee_lv,address
39,9,131779898,102,IC0029B,-1,Quản lý dự án,20200600,20220100,59.0,Tp. Hà Nội
40,9,131779898,102,IC0029B,-1,NaN,20220200,20220200,59.0,NaN
41,9,131779898,102,IC0029B,-1,Quản lý dự án,20220300,20220400,59.0,NaN
132,32,114030539,7509,YN0121I,-1,Quản trị viên tập sự,20170700,20180600,52.0,Đồng Nai
133,32,114030539,7509,YN0121I,-1,Quản trị viên tập sự,20180700,20181200,55.0,Đồng Nai
...,...,...,...,...,...,...,...,...,...,...
151957,49355,4025569131,7900,YN0486Z,-1,Trưởng phòng,20180700,20190600,55.0,TP.HCM
151958,49355,4025569131,7900,YN0486Z,-1,Trưởng phòng,20190700,20200800,59.0,TP.HCM
151959,49355,4025569131,7900,YN0486Z,-1,NaN,20200900,20210200,59.0,NaN
151960,49355,4025569131,7900,YN0486Z,-1,Trưởng phòng,20210300,20220400,59.0,NaN
155309,51310,7411076779,7509,YN0121I,-1,Chuyên viên - Đào tạo kỹ thuật,20220100,20220400,51.0,Đồng Nai)

In [25]:
work.describe()

,id,id_bh,id_management,company_type,from_date,to_date,employee_lv
count,409842.000000,4.098420e+05,409842.000000,409842.000000,4.098420e+05,4.098420e+05,409834.000000
mean,30840.738975,3.916199e+09,3565.329383,0.639432,2.014827e+07,2.015701e+07,8.111279
std,15652.978624,2.766450e+09,2371.753886,2.854080,5.794083e+04,5.538133e+04,6.988868
min,1.000000,1.000007e+08,100.000000,-1.000000,1.968110e+07,1.975080e+07,-1.000000
25%,20426.000000,2.408009e+09,2400.000000,-1.000000,2.012030e+07,2.013060e+07,5.000000
50%,31014.000000,2.616138e+09,2600.000000,-1.000000,2.016100e+07,2.017070e+07,7.000000
75%,44674.000000,6.822600e+09,4900.000000,1.000000,2.019030e+07,2.020030e+07,9.000000
max,55011.000000,9.820174e+09,9600.000000,8.000000,2.022040e+07,2.031100e+07,369.000000

In [26]:
## 2.5. job/role

### 2.6. address

In [27]:
work['address'].value_counts()

Vĩnh Phúc                 70289
Bắc Ninh                  15127
Bắc Giang                 13830
Hà Nội                    12991
tỉnh Nghệ An              12726
                          ...
CHDCND Lào                    1
sư đoàn 333 Quân khu 5        1
CT                            1
XD &amp; KDN SÀI GÒN          1
Cầu giấy HN                   1
Name: address, Length: 2141, dtype: int64

In [28]:
## can xu ly text: chuyen tu viet tat dia danh thanh ten that (HN - HA NOI, THPCM - ), SAI GON - THANH PHO HO CHI MINH
##

### 2.7. Date - can check ngay lai xem thoi gian max, min la ntn

### Problem:
#### 1. xu ly text (category var): 
- option 1(uu tien): sua dc cai nao thi sua
- option 2(): dung k-mean ==> cluster ve 63 tinh thanh?, hoac word-simarity
#### 2. Tong hop features: nhieu nghe? chuyen viec nhieu?
- Can xem xem: cai muc luong trong label la luong cua muc gan nhat?
- Can ket hop: group by roi them 1 so fea:
            - So cong viec lam truoc day (count cai job)
            - So lan chuyen viec, ... (count unique cai id)
            - So lan len chuc (count unique id cua toa nha?)